{"posts":{"2023":{"03":{"08":{"title":"Triskar and its Orbs","content":"<p>The Triskar is pretty much what sparked everything else that you see here.</p>\n<p>There is a few versions that exist for the different realms of the Different World,\nthough all of them have the main purpose to allow its bearer to <em>control</em> their <em>time</em> cycles.</p>\n<p><img src=\"/src/Triskar.png\" alt=\"Triskar\" />\nThis holder is made like a 3d version of the Triquetra,\nshowing that each of the three cycles are intertwined.</p>\n<p><img src=\"/src/Orb-Sun.png\" alt=\"Sun\" />\nThe <strong>Sun</strong> orb carries the Turtle Sun,\neach head pointing at a general weather\n(Clear, Cloudy, Thunders, Rain, and Snow)\nand under the Night sky is represented\nby what looks like a DNA strand,\nand a constellation of two sets of two stars represent\nthe Inner and Outer grandiose.\nThis is where it all began, the Turtle Sun,\nthe mythical image of a five headed turtle swimming\nin the sky sea out of which the fates of our day down poured.\nThat came to me on a cloudy day by the docks of old Stockholm</p>\n<p><img src=\"/src/Orb-Moon.png\" alt=\"Moon\" />\nThe <strong>Moon</strong> orb carries the swirling faces of the moon,\none showing the uncanny smile (friend of friends, foe of foes) of its shaded side,\nand the other is an abstraction of the moon's craters\nto show the 13 lunar months in a year,\nin a spiral motion as a soft reminder of the Triskelion,\nas well as apparently chaotic \"irrigation marks\"\nthat join at different angles.</p>\n<p><img src=\"/src/Orb-Wheel.png\" alt=\"Wheel\" />\nThe <strong>Wheel</strong> orb carries 8 eyes or 8 plants depending on how you look at it,\neach of which having the presence or absence of three separate elements,\na vertical line, a horizontal line, and a point.\nSome could interpret these as three different genders and their associated \"seasons\"\nbut the idea is a reminder of the agricultural wheel.</p>"},"09":{"title":"Quaster and its Orbs","content":"<p>The Quaster is what I feel the evolution of the Triskar.\nWhile the Triskar's focus is on empowering oneself with time,\nThe Quaster's aim is to have <em>stewardship</em> over <em>matter</em>.</p>\n<p>There is less of them in circulation than the Triskar,\nbut a few of its orbs exist free spirited.</p>\n<p><img src=\"/src/Quaster.png\" alt=\"Quaster\" />\nThis holder looks like two branches twisted together.\nHaving multiple names (Quaster, Twinhorn, Dikryos, and a few others)\nits main purpose is to give its bearer control over the four forces that shape the Different World,\nknown as <em>Gleam</em>, <em>Stone</em>, <em>Yarn</em> and <em>Seeds</em>.</p>\n<p><img src=\"/src/Orb-Yarn.png\" alt=\"Yarn\" />\n<strong>Yarn</strong> refers to the first of four \"forces\" channelled in the Quaster.\nIt specifically helps create or maintain bonds, and in a way represent safety,\nlife lines, as well as in any way where something or someone is fastened to another.\n5 Strings, two pairs in parallel and one alone all on different right axes,\nare interwoven at 16 different meeting points.</p>\n<p><img src=\"/src/Orb-Stone.png\" alt=\"Stone\" />\n<strong>Stone</strong> refers to the force of gravity, helping to push, propulse, fight, move mountains,\nthe general idea of having stewardship over heavy matter.\nIts presentation is meant to represent two masses having mirroring effect on each other,\nhence the swirl clockwise meeting the swirl anti-clockwise.</p>\n<p><img src=\"/src/Orb-Seeds.png\" alt=\"Seeds\" />\n<strong>Seeds</strong> refers to the quantic force of emergence and fluidity.\nSand shifting around revealing the hidden,\nwaters slowly reshaping its own course beyond its myriad of drops,\nmoney accrued and its potentials.\nIts representation is 22 dots arranged with one centred around a small pentagon,\na big pentagon, a decagon, and a seemingly lost dot at its opposite end.</p>\n<p><img src=\"/src/Orb-Gleam.png\" alt=\"Gleam\" />\n<strong>Gleam</strong> refers to the near instantaneous, reactive force of light.\nWhile mainly focused on emitted visuals, it also takes on the realm of sound,\nspecifically wind instruments. I find it helps me see what is usually out of reach.\nIt is represented by 7 waves vibrating from 3 to 9 times across the the sphere,\nmeeting at seemingly chaotic points.</p>\n<p>As a reference, personally, the orb I connect most with is the Marsh Gleam,\nas I find it fits with my base personality most.</p>"}},"04":{"11":{"title":"Eyol","content":"<p><img src=\"/src/Eyol.png\" alt=\"Eyol\" /></p>\n<p>This odd little bird ball whistle watches as one moves and plays it around.</p>\n<p>After a late night mushroom stew,\nI had one of those wild dreams that I quite enjoy\nand found myself in the same realm that I used to visit as a kid.</p>\n<p>That realm is odd.\nIt maps out fairly consistently around my childhood house,\nbut has a somewhat hyperbolic space to it,\nwith an increasing quantity of thematic places the further I go from the centre.\nIt's honestly weird, especially that it remained constant over the years.</p>\n<p>The Owl of olden days, which when a kid would bring me to the animal town, also stopped by.</p>\n<p>Though its appearance this time seemed unreal. I felt like it was comfortable revealing its true shape, which was spherical and kaleidoscopal in nature, with way more eyes than I had ever felt at ease looking at me.</p>\n<p>I had seen images of angels with their multiple eyes but that was the first time it happened to me.</p>\n<p>I could feel its hunger (owls are carnivorous after all), but also its wisdom.\nAnd it was clear that I had to allow it to live in this world.</p>\n<p>After a bit of tinkering, it was finally freed as a handheld blow whistle.</p>"},"16":{"title":"Odsol","content":"<p><img src=\"/src/Woodsoul.png\" alt=\"Wood's soul\" /></p>\n<p>A flower pot made as an effigy of the Wood's soul, or Odsol,\na deer head painted with scenes of the land and sea throughout a day.</p>\n<p>I enjoy walks and bike rides in nature.</p>\n<p>One day though, as I was crossing into the deeper woodlands of North Vancouver, a weird sorrow overtook me.</p>\n<p>The more I \"discussed\" with the feeling, the more it became clear that I was conversing with a fallen deer.</p>\n<p>I don't know much else about this, but I was pressed with the need to remind myself of that experience.</p>\n<p>At first, I was trying to make a wearable mask, but ended up downsizing to make it a flower pot.\nThis felt in a way much more respectful for the animal.</p>\n<p>Now, weirdly, as I write this down, I have a feeling of deja vu. Huh. As if I wrote this before. Weird.</p>\n<p>May you roam free, graceful wild one.</p>"},"21":{"title":"Lotusnail","content":"<p><img src=\"/src/Lotusnail1.png\" alt=\"Lotusnail\" />\nA snail shell on which grows a lotus.</p>\n<p>This creation was made first as a gift to a friend,\nand I feel that it is worth sharing to the greater world too.</p>\n<p>This was in a way a being that represented what they wanted to do, bloom over time.</p>\n<p><img src=\"/src/Lotusnail2.png\" alt=\"Lotusnail\" />\nI know that very entity exists somewhere, whatever existing mean.</p>\n<p>Its dual fractal patterns represent both work and aesthetics,\nboth ephemerality and durability.</p>"}},"06":{"20":{"title":"The Uncertain","content":"<p>I've dealt with the uncertain at multiple occasions.</p>\n<p><img src=\"/src/Solstice.png\" alt=\"Solstice\" />\nAs the sun stands still for us in this half year mark,\nI wish for all the freedom to do, play, love, be and become as they please.</p>\n<p>It is easy to succumb to the morose. It is easy to lash at clouds.\nI suggest <em>journaling</em>, a bit as I here do, albeit more raw.</p>\n<p>To ink hard truths, harsh thoughts, and sorrows, and vanities, all as they come,\nhas dealt me a confidence that only a kind self-derision can deal.</p>\n<p>In this exception, this ephemeral forever that is to biological exist, I see the same in all things,\nand it pains me to no end that a neighbour, be they close or far, has less chance than I've had,\nto be freed of chains, be they selfmade or elsebrought.</p>\n<p>I commit to, through my daily work, deeds and craft,\nbring peace in one way or another to at least one person per day,\nas well as show gratitude to whoever would do the same to me.</p>\n<p>Isn't it witchcraft to break soulshackles?</p>\n<p>Isn't it magical to read back at who we once were?</p>"},"01":{"title":"A Breach","content":"<p>I finally made a breakthrough, and feel proud for it.</p>\n<p>I can feel in my bones that I have released what must.</p>\n<p>In simple, I've had a lot of different things that happened, more good than bad,\nthat kind of \"proved\" to me that the path I was taking was the right one.</p>\n<p>It feels a bit as if the fog-veil was lifted over my eyes.</p>\n<p>I've removed a lot of things that cluttered my space,\nand gave a hug to that which I was saying my farewells.</p>\n<p>Sometimes a clean up declutters the physical and mental worlds.</p>\n<p>And I can finally feel my fingers work with the finesse that I had dearly missed.</p>"}},"09":{"01":{"title":"The Mighty Eleven","content":"<p>Summer is to me a period of travel, enjoyment, biking and all, hence the here breather.</p>\n<p>It was not out of creativity.</p>\n<p>I got a clear image of a flying fish over the moon, and soon enough eleven 7-sided stained glass followed suite.</p>\n<ul>\n<li><p><img src=\"/src/Mighty-Fish.png\" alt=\"Flying Fish\" />\nThe <strong>Flyer</strong> flies above the moon. This flying fish knows few boundaries. Abundance offered, Needs met, Challenges accepted.</p></li>\n<li><p><img src=\"/src/Mighty-Chicken.png\" alt=\"Caring Chicken\" />\nThe <strong>Carer</strong> cares for its egg. This chicken will love as much as it was loved. Cycles continued, Ancestors respected, Moment cherished.</p></li>\n<li><p><img src=\"/src/Mighty-Bear.png\" alt=\"Beckoning Bear\" />\nThe <strong>Beckoner</strong> beckons you to join over the moon. This silly sun bear shows the way. Dreams embellished, Perspective brought, Companionship enabled.</p></li>\n<li><p><img src=\"/src/Mighty-Foxes.png\" alt=\"Frolicking Foxes\" />\nThe <strong>Frolickers</strong> frolic in the prairie. One of these two foxes wonders over a fallen star, while the other could not be less bothered. Time enjoyed, Discoveries made, Tales shared.</p></li>\n<li><p><img src=\"/src/Mighty-Turtle.png\" alt=\"Turning Turtle\" />\nThe <strong>Turner</strong> turns its heads for the fate of the day. This turtle swims in the sky sea. Weathers passed, Daily things done, Plans followed through.</p></li>\n<li><p><img src=\"/src/Mighty-Wolf.png\" alt=\"Whistling Wolf\" />\nThe <strong>Singer</strong> sings by the moon. This wolf is aware its place and role in nature. Fate accepted, Pack tightened, Duties fulfilled.</p></li>\n<li><p><img src=\"/src/Mighty-Swirlers.png\" alt=\"Swirling Swirlers\" />\nThe <strong>Swirlers</strong> swirl. These dancers share bonds beyond generations and borders. Humanity restored, Divine recognized.</p></li>\n<li><p><img src=\"/src/Mighty-Whale.png\" alt=\"Warding Whale\" />\nThe <strong>Ward</strong> carries through the past and back. The whale and dog knows that dreams are alive if you know when to strive for them while there is time. Memories carved, Difficult achieved.</p></li>\n<li><p><img src=\"/src/Mighty-Owl.png\" alt=\"Eyol\" />\nThe <strong>Seer</strong> sees everything about you. This many eyed owl is a most potent being, capable of transporting across realm they who call upon it. Knowledge accessed, Paths opened.</p></li>\n<li><p><img src=\"/src/Mighty-Raven.png\" alt=\"Revealing Raven\" />\nThe <strong>Revealer</strong> reveals what's East from West on the Known Star. This raven will remember both those who wrong you and those who aid you, giving the right message to the right person. News shared, People beguiled.</p></li>\n<li><p><img src=\"/src/Mighty-Elephant.png\" alt=\"Elegant Elephant\" />\nThe <strong>Player</strong> plays with Saturn. This elephant brings good fortune to those who sowed at least a little.</p></li>\n</ul>"}}}}}